Tekla Open API Reference for Tekla Structures 2025
OBB.SetAxis Method
Overload List
Name | Description
SetAxis(Vector[])
 Sets the Axis to the OBB.
SetAxis(Vector, Vector, Vector)
 Sets the Axis to the OBB.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace